---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRunCreateAutoLanding
source: html/d944e6ae-ad81-85b2-6031-e8fd4117a0f3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRunCreateAutoLanding Property

"With Automatic Landing": Create automatic landing

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRunCreateAutoLanding { get; }
```